# 转义符号
print("i\"m \"ok\"")

# 使用r''表示''内部字符串默认不转义
print('\\\t\\')
print(r'\\\t\\')
print(r"i\"m \"ok\"")
print('123\n456')
print(r'123\n456')

# '''...'''的格式表示多行内容
print('''line1
line2
line3''')

# 赋值

# 解释器创建了字符串'ABC'和变量a，并把a指向'ABC'
a = "ABC"
# 解释器创建了变量b，并把b指向a指向的字符串'ABC'
b = a
print(f"b:{b}")
# 解释器创建了字符串'XYZ'，并把a的指向改为'XYZ'，但b并没有更改
a = "XYZ"
print(f"b:{b}")

# 常量
# 通常用大写的变量名表示常量
PI = 3.14159265359
# 除法 /,结果为浮点数
print(f"10 / 3 等于：{10 / 3}")
# 地板除 //,结果为整数
print(f"10 // 3 等于：{10 // 3}")
# 取余 %
print(f"10 % 3 等于：{10 % 3}")





